[
	{
		"title": "“If it were not for” and “if it had not been for”: Which is more traditional?",
		"body": "Some use \"if it were not for\" to mean both the present and the past events, while others use \"if it had not been for\" for the past. For the former, see Oxford and be (verb) in OALD. For example, OALD's definition says \"used to say that somebody/something stopped somebody/something from happening\", i.e. it explicitly says it's the past event. See also this question in ell.stackexchange.\n\nMy first impression was that the former is more recent, but I now suspect the opposite may be the case. Has the usage changed over time (or over decades/centuries)?\n\nBTW many sites say \"If it were not for hopes, the heart would break.\" is the word of Thomas Fuller (1608-1661) but I cannot verify it.",
		"createdAt": "10/16/2019",
		"author": 81
	},
	{
		"title": "How can we say that the government declared that a particular day is off due to, for example, air pollution?",
		"body": "As a result of air pollution, sometimes the government shuts the schools and universities. What if they declare the entire day (and not just for schools) is off? I don't think we can say \"They declared Saturday a holiday\" since \"holiday\" has a positive connotation implying that people were given the chance to take a vacation. Is there a general term for that?",
		"createdAt": "04/26/2020",
		"author": 37
	},
	{
		"title": "'polymorphic' is to “many changes” as ??? is to “many behaviors”?",
		"body": "In an OOP context, \"polymorphic\" is an imprecise description of class method overrides. The form (or shape) of the method is exactly the same as the base; the only thing that changes is the behaviour of the override by enhancing or (shudder) replacing the base behaviour\n\nI've tried translating \"many behaviours\" back and forth, but the swamp of technical explanations of how polymorphism works hides any chance of finding some linguistic information\n\nI need a Greek or English linguist to figure out the Anglicized Greek-root compound form as an example, not to try and replace the term in usage\n\nPlease advise",
		"createdAt": "09/26/2019",
		"author": 87
	},
	{
		"title": "Single word synonym for “misnomer”",
		"body": "Merriam's just giving me synonyms for \"nickname or \"other name\"\n\nI want to emphasize that the name being given is incorrect, and maybe even slightly offensive (not purposefully though) I'm looking for a word that describes a misnomer that stems from ignorance, not malice, so \"insult\" and \"slur\" are too far.\n\na similar thread suggested \"catachresis\"—literally mis use, but it's so technical and not quite it.\n\nan \"assumptive title\" is more what I'm looking for, like calling someone you don't see outside often a hermit. Maybe they venture out while you sleep. Or calling a typically non-emotive person a robot (assuming they are incapable of emoting when likely emotion is present but being repressed etc. etc.)\n\nMiser is a bit of a/an _____ . I just made a major purchase yesterday, that's why I'm penny pinching.",
		"createdAt": "10/12/2019",
		"author": 73
	},
	{
		"title": "does sound th as d makes any difference in fast speech?",
		"body": "I know the 2 kinds of th sound, the question is does pronouncing, for instance, \"that\" as \"dat\" makes any difference to real th sound? I know pronouncing it in slow speech or out of a sentence really does but and about fast speech? in fast speech \"that\" always sounds as \"dat\", i'm talking about non-blown d sound.",
		"createdAt": "10/02/2019",
		"author": 79
	},
	{
		"title": "What is the origin of the phrase “up the guts”",
		"body": "'Up the guts' is a colloquial phrase used in New Zealand and Australia generally to refer to a direct (both literal and figurative) approach to something.\n\nIt is somewhat vulgar, but not generally considered offensive.\n\nIt is used in everyday language, but is particularly common in Rugby and sporting lexicon, in which it means to run or play the ball straight (generally through the opposition rather than around them), covering the shortest distance possible in order to score a point.\n\nFor example:\n\nPerson A: \"What's the play?\"\n\nPerson B: \"Nothing fancy. Straight up the guts.\"\n\nIt has been claimed by some to have misogynistic origins, however I can't find any proof or explanation of this.\n\nAny help much appreciated.",
		"createdAt": "01/27/2020",
		"author": 32
	},
	{
		"title": "Better expression than chauvinist for male dominant attitude",
		"body": "I'm getting a hard time to find an appropriate word on English with similar meaning to the portuguese word \"machismo\".\n\nIn portuguese this word means a conservative pro-male attitude, like an attitude that reinforces patriarchy and male dominance.\n\nExample: a man that sees woman as inferior to man and should only be an house keeper and don't get a job. Or a man that uses and objectifies women.\n\nNow every translation I've seen uses either chauvinism or sexism for this. I don't see neither as appropriate because chauvinism is more related with fanatic nationalism and sexism AFAIU can be from both sexes.\n\nCan anyone think of a better way to express this idea of male dominant attitude?",
		"createdAt": "10/21/2019",
		"author": 93
	},
	{
		"title": "Woken or Have woken",
		"body": "Woken up late . I had to take a taxi to attend the first lecture.\n\nOR\n\nHave woken up late . I had to take a taxi to attend the first lecture.\n\nWhich one is the correct sentence, please help me guys as soon as possible.",
		"createdAt": "01/28/2020",
		"author": 23
	},
	{
		"title": "What is a single adverb for how something is supposed to be + verb",
		"body": "Take the following sentence.\n\nThe object is usually stacked.\n\nThis perhaps implies that it is supposed to be stacked, but really only says that it is stacked most of the time.\n\nSay the object is supposed to be thrown. How could I say, \"The object is 'meantly' thrown.\"?\n\nI'm looking for a single word that perfectly replaces supposed to be, such as \"The document is supposed to be where the text appears.\" or \"The document is supposed to be read.\"\n\nDoes it exist? If so, would there be an adjective form like usual is for usually?",
		"createdAt": "01/03/2020",
		"author": 2
	},
	{
		"title": "What's the expression of “necessarily satisfied” in mathematics?",
		"body": "I want to say:\n\nConsider a>b, if b>c, then a>c is necessarily satisfied.\n\nWill it be better by using \"must\"\n\nConsider a>b, if b>c, then a>c must be satisfied.\n\nor with nothing\n\nConsider a>b, if b>c, then a>c is satisfied.\n\nThank you very much!\n\nMore clearly, I want to use \"satisfied\" because a>c is a constraint where \"a\" is a variable while \"b\" and \"c\" are constants. I want to express that since \"a>b\", if \"b>c\", then constraint \"a>c\" should not be considered. So how should I express this? Thnaks for your suggestion.",
		"createdAt": "03/01/2020",
		"author": 7
	},
	{
		"title": "How do you quote a passage that has used '[sic]' mistakenly?\n",
		"body": "The usage of '[sic]' is well defined for quoting a passage that you believe has an error in it: nearest to the mistake you place '[sic]' within the quotes. For example, suppose I write a letter from I to you. This last sentence of mine is counter to most norms of English writing (it's wrong), so in quoting it someone would naturally want to write:\n\n...suppose I write a letter from I [sic] to you.\n\nSuppose though that I do something else, suppose I write a letter from me to you. This follows accepted grammatical practice (it's correct grammar). But then further suppose that someone thinks you should use 'I' instead of 'me'. And they quote it thus:\n\n...suppose I write a letter from me [sic] to you.\n\nThe '[sic]' has been mistakenly used.\n\nBut how do you quote the passage I just wrote? Would it be:\n\n\"...suppose I write a letter from me [sic] to you.\" [sic]\n\nor\n\n\"...suppose I write a letter from me [sic] [sic] to you.\"\n\nor\n\n\"...suppose I write a letter from me [sic [sic]] to you.\"\n\nNone of these sound right to me: the first because it doesn't point out where the error is, the second because you can't tell (for either '[sic]') if you're using '[sic]' or it is part of the thing quoted, and for the third example...well, that might be a way to mark the error, but surely the mechanics of '[sic]' could have been designed better to begin with.\n\nSo which of these three, or something else entirely, should be used for quoting a passage where '[sic]' is used wrongly?",
		"createdAt": "03/13/2020",
		"author": 59
	},
	{
		"title": "Did English ever have a formal version of “you”?",
		"body": "From the top of my head, Danish \"De\" (practically never used), German \"Sie\", Chinese \"您\", French \"vous\", Spanish \"usted\" are a formal way of addressing someone, especially if one isn't familiar with the addressee. Did English ever have this? It sounds as though Proto-Indo-European might have had this (based on my 4 examples), but perhaps someone can enlighten me?",
		"createdAt": "04/13/2020",
		"author": 13
	},
	{
		"title": "Is there a correct gender-neutral singular pronoun (“his” vs. “her” vs. “their”)?",
		"body": "Is there a pronoun I can use as a gender-neutral pronoun when referring back to a singular noun phrase?\n\nEach student should save his questions until the end.\nEach student should save her questions until the end.",
		"createdAt": "05/05/2020",
		"author": 71
	},
	{
		"title": "What is the correct way to pluralize an acronym / initialism?",
		"body": "For example, if I wanted to write the equivalent of\n\nThere are many automated teller machines in this city.\n\nWould it be\n\nThere are many ATMs in this city.\nor\n\nThere are many ATM's in this city.\n(could get confused with possessive form or contraction).\nor just\n\nThere are many ATM in this city.\n(assuming the final s is included in Machines represented by M).\nMaybe something else?",
		"createdAt": "02/16/2020",
		"author": 83
	},
	{
		"title": "When should I use an em-dash, an en-dash, and a hyphen?",
		"body": "I generally know how to use a hyphen, but when should I use an en-dash (–) instead of an em-dash, or when should I use a hyphen (-) instead of an em-dash (—)?",
		"createdAt": "09/13/2019",
		"author": 8
	},
	{
		"title": "What is the rule for adjective order?",
		"body": "I remember being taught that the correct order of adjectives in English was something along the lines of \"Opinion-Size-Age-Color-Material-Purpose.\"\n\nHowever, it's been a long time and I'm pretty sure I've forgotten a few categories (I think there were eight or nine). Can anyone fill them in?",
		"createdAt": "01/02/2020",
		"author": 88
	},
	{
		"title": "Is there a phrase that means sleeping with someone without sex?",
		"body": "The phrase \"sleeping with someone\" often means \"having sex.\" What is the origin of this sexual connotation? Is there a non-sexual equivalent of this phrase to express sleeping with someone without sexual intercourse?",
		"createdAt": "05/10/2020",
		"author": 45
	},
	{
		"title": "How many spaces should come after a period/full stop?",
		"body": "In the past — or at least, when I was in elementary school — periods/full stops were followed by two spaces. Lately, it's become more and more common to see just one space. In the modern world, should we still use two spaces between sentences, or is just one okay? Does it depend on the situation? Or are both acceptable, with the choice simply coming down to personal preference?",
		"createdAt": "09/21/2019",
		"author": 49
	},
	{
		"title": "Is there a word or phrase for the feeling you get after looking at a word for too long?",
		"body": "Sometimes after looking at a word for a while, I become convinced that it can't possibly be spelled correctly. Even after looking it up, sounding it out, and realizing that there's simply no other way to spell the word, it still looks wrong.\n\nIs there a shorthand way to describe this feeling so that people will know what I mean without the long explanation?",
		"createdAt": "08/15/2019",
		"author": 59
	},
	{
		"title": "How are “i.e.” and “e.g.” pronounced?",
		"body": "How are i.e. and e.g. pronounced?",
		"createdAt": "01/30/2020",
		"author": 66
	},
	{
		"title": "What is the factual basis for “pirate speech”? (Did pirates really say things like “shiver me timbers”?)",
		"body": "The \"pirate speech\" we hear/see/read, for example, on the website Talk Like A Pirate Day consists of a rhotic dialect characterized by phrases like \"shiver me timbers,\" \"ooh arh me hearties,\" and so on and so on.\n\nWhat is its basis in fact?",
		"createdAt": "10/27/2019",
		"author": 62
	},
	{
		"title": "Which words in a title should be capitalized?",
		"body": "Are there any concrete rules that say which words (parts of speech) in a title should start with a capital letter? What would be a correct capitalization for the title of this question?",
		"createdAt": "10/14/2019",
		"author": 23
	},
	{
		"title": "What is the plural form of “status”?",
		"body": "What is the plural form of “status”?",
		"createdAt": "04/25/2020",
		"author": 17
	},
	{
		"title": "Are “whores” and “horse” homophones?",
		"body": "I’m Spanish but sometimes see TV shows in English.\n\nMy question is whether the words horse and whores sound exactly the same, because in many English language TV shows it seems like they are, which really surprises me.\n\nAre they homophones?\n\nI cannot hear any voicing at the end of the word whores to distinguish the two words.",
		"createdAt": "10/13/2019",
		"author": 26
	},
	{
		"title": "“log in to” or “log into” or “login to”",
		"body": "When writing an instruction about connecting to a computer using ssh, telnet, etc., I'm not sure what spacing to use in this familiar spoken phrase:\n\n\"Log in to host.com\"\n\"Log into host.com\"\n\"Login to host.com\"\nMaybe this is entirely subjective or the realm of industry jargon, but I couldn't think of anywhere else to ask. Any insight?",
		"createdAt": "05/09/2020",
		"author": 73
	},
	{
		"title": "What is wrong with the word “performant”?",
		"body": "I keep getting the red underlining in Word whenever I write the word \"performant\". Here I intend to refer to something that performs well or better than something else (i.e., it's more performant).\n\nIs there something wrong with that word? Does it mean what I actually want it to say?",
		"createdAt": "06/08/2019",
		"author": 69
	},
	{
		"title": "“Unregister” vs “Deregister”",
		"body": "The concept of \"undoing a registration\" is widely used in my line of work. While most dictionaries define unregister as the proper verb for it, several widely used and highly considered sources also use the verb deregister. Do both verbs exist? Are they synonyms? Is there a slight difference in their meaning?",
		"createdAt": "12/23/2019",
		"author": 20
	},
	{
		"title": "When to use “If I was” vs. “If I were”?",
		"body": "When is it correct to use \"If I was\" vs. \"If I were\" in standard English?",
		"createdAt": "05/20/2020",
		"author": 81
	},
	{
		"title": "What the #$@&%*! is that called?",
		"body": "Is there a name for the use of symbols in place of curse words, for example #$@&%*!?",
		"createdAt": "07/30/2019",
		"author": 68
	},
	{
		"title": "When is it appropriate to end a sentence in a preposition?",
		"body": "Like many others, I commonly find myself ending a sentence with a preposition. Yes, it makes me cringe. I usually rewrite the sentence, but sometimes (in emails) I just live with it. To, with... you know who you are.\n\nShould I keep fighting myself on this one, or is it okay in some circumstances?",
		"createdAt": "04/29/2020",
		"author": 50
	}
]